# Task 02 - Track B: Advanced DataFrame Operations

**Course:** Database Applications Development  
**Lesson:** 02 - Working with DataFrames (Preparing for SQL)  

---

## Instructions

Complete all exercises in this notebook. Track B includes significantly more practice with multiple conditions, chaining operations, and deeper analysis.

**Submission:**
1. Save this notebook as `dbAppsTask02TrackB.ipynb`
2. Add, commit, and push to your `databaseApplications` repository on GitHub
3. Verify the file appears correctly on GitHub

---

## Setup: Load the Dataset

In [2]:
# Import pandas and load data
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

# Quick check
print(titanic.shape)
titanic.head()

(1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

---

## Part 1: Selecting Columns

### Exercise 1.1: Select Single Columns

Select and display the first 10 values:
1. The 'age' column
2. The 'fare' column

In [7]:
# Age column
ages = titanic['age']
print(ages.head(10))

0    29.00
1     0.92
2     2.00
3    30.00
4    25.00
5    48.00
6    63.00
7    39.00
8    53.00
9    71.00
Name: age, dtype: float64

In [9]:
# Fare column
fares = titanic['fare']
print(fares.head(10))

0    211.3375
1    151.5500
2    151.5500
3    151.5500
4    151.5500
5     26.5500
6     77.9583
7      0.0000
8     51.4792
9     49.5042
Name: fare, dtype: float64

### Exercise 1.2: Select Multiple Columns

Create a DataFrame called `passenger_info` with these columns: 'name', 'sex', 'age', 'survived'

Display the first 10 rows.

In [10]:
# Your code here
passenger_info = titanic[['name', 'sex', 'age', 'survived']]
print(passenger_info.head(10))

                                              name     sex    age  survived
0                    Allen, Miss. Elisabeth Walton  female  29.00         1
1                   Allison, Master. Hudson Trevor    male   0.92         1
2                     Allison, Miss. Helen Loraine  female   2.00         0
3             Allison, Mr. Hudson Joshua Creighton    male  30.00         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00         0
5                              Anderson, Mr. Harry    male  48.00         1
6                Andrews, Miss. Kornelia Theodosia  female  63.00         1
7                           Andrews, Mr. Thomas Jr    male  39.00         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female  53.00         1
9                          Artagaveytia, Mr. Ramon    male  71.00         0

---

## Part 2: Filtering Rows

### Exercise 2.1: Filter by Survival

Create a DataFrame called `survivors` with only passengers who survived.

Print how many survivors there were.

In [18]:
# Your code here
survived_condition = titanic['survived'] == 1
survivors = titanic[survived_condition]

print(f"Survivors: {len(survivors)}")

Survivors: 500

### Exercise 2.2: Filter by Gender

Create a DataFrame called `females` with only female passengers.

Print how many there were.

In [17]:
# Your code here
sex_condition = titanic['sex'] == "female"
females = titanic[sex_condition]

print(f"Number of Females: {len(females)}")

Number of Females: 466

### Exercise 2.3: Filter by Class

Create a DataFrame called `first_class` with only first class passengers.

Print how many there were.

In [20]:
# Your code here
class_condition = titanic['pclass'] == 1
first_class = titanic[class_condition]

print(f"Number of First Class: {len(first_class)}")

Number of First Class: 323

### Exercise 2.4: Filter by Age

Create a DataFrame called `children` with passengers 12 or younger.

Print how many there were.

In [27]:
# Your code here
mask = titanic['age'] <=12
print(mask.head())

children = titanic[mask]

print(children['age'])

0    False
1     True
2     True
3    False
4    False
Name: age, dtype: bool
1        0.92
2        2.00
54      11.00
94       4.00
273      6.00
        ...
1240     0.42
1256     7.00
1257     9.00
1263    11.50
1265    10.00
Name: age, Length: 94, dtype: float64

---

## Part 3: Sorting Data

### Exercise 3.1: Sort by Age

Sort passengers by age and display name and age for the 10 youngest.

In [29]:
# Your code here
youngest = titanic.sort_values('age')[['name', 'age']]
print(youngest.head(10))

                                         name   age
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17
747   Danbom, Master. Gilbert Sigvard Emanuel  0.33
1240          Thomas, Master. Assad Alexander  0.42
427                 Hamalainen, Master. Viljo  0.67
658             Baclini, Miss. Helene Barbara  0.75
657                    Baclini, Miss. Eugenie  0.75
1111           Peacock, Master. Alfred Edward  0.75
611                 Aks, Master. Philip Frank  0.83
359             Caldwell, Master. Alden Gates  0.83
548           Richards, Master. George Sibley  0.83

### Exercise 3.2: Sort by Fare

Sort passengers by fare (highest first) and display name and fare for the top 10.

In [32]:
# Your code here
Highest = titanic.sort_values('fare', ascending=False)[['name', 'fare']]
print(Highest.head(10))

                                                  name      fare
302                                   Ward, Miss. Anna  512.3292
49                  Cardeza, Mr. Thomas Drake Martinez  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292
183                             Lesurer, Mr. Gustave J  512.3292
116                Fortune, Mrs. Mark (Mary McDougald)  263.0000
111                     Fortune, Miss. Alice Elizabeth  263.0000
115                                  Fortune, Mr. Mark  263.0000
114                     Fortune, Mr. Charles Alexander  263.0000
113                         Fortune, Miss. Mabel Helen  263.0000
112                         Fortune, Miss. Ethel Flora  263.0000

---

## Part 4: Statistics

### Exercise 4.1: Overall Statistics

Calculate and print:
1. Average age
2. Average fare
3. Maximum fare
4. Minimum age

In [35]:
# Your code here
print("Average age:", titanic['age'].mean())
print("Average fare:", titanic['fare'].mean())
print("Minimum age:", titanic['age'].min())
print("Maximum fare:", titanic['fare'].max())

Average age: 29.881137667304014
Average fare: 33.29547928134557
Minimum age: 0.17
Maximum fare: 512.3292

### Exercise 4.2: Statistics on Filtered Data

Calculate:
1. Average age of survivors
2. Average fare of first class passengers

In [36]:
# Your code here
survivors = titanic[titanic['survived'] == 1]
print("Average survivor age:", survivors['age'].mean())

first_class = titanic[titanic['pclass'] == 1]
print("Average first class fare:", first_class['fare'].mean())

Average survivor age: 28.91824355971897
Average first class fare: 87.50899164086688

---

## Part 5: Value Counts

### Exercise 5.1: Count Values

Use `.value_counts()` to find:
1. How many in each class
2. How many male vs female
3. How many survived vs died

In [38]:
# Class counts
print(titanic['pclass'].value_counts())

pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [40]:
# Gender counts
print(titanic['sex'].value_counts())

sex
male      843
female    466
Name: count, dtype: int64

In [42]:
# Survival counts
print(titanic['survived'].value_counts())

survived
0    809
1    500
Name: count, dtype: int64

---

## Part 6: Multiple Condition Filtering (Track B)

Combine conditions using & (AND) and | (OR). Remember: each condition needs parentheses!

### Example: Combining Conditions

In [ ]:
# AND (&) - Both conditions must be True
# Find male survivors
male_survivors = titanic[
    (titanic['sex'] == 'male') & 
    (titanic['survived'] == 1)
]
print(f"Male survivors: {len(male_survivors)}")

# OR (|) - At least one condition must be True
# Find first or second class passengers
upper_class = titanic[
    (titanic['pclass'] == 1) | 
    (titanic['pclass'] == 2)
]
print(f"Upper class passengers: {len(upper_class)}")

# CRITICAL: Each condition MUST have parentheses around it!

### Exercise 6.1: Female Survivors

Find all female passengers who survived.

How many were there?

In [53]:
# Your code here
# Hint: (titanic['sex'] == 'female') & (titanic['survived'] == 1)
result = titanic[
    (titanic['sex'] == 'female') & 
    (titanic['survived'] == 1)
]
print(result)

      pclass  survived                                               name  \
0          1         1                      Allen, Miss. Elisabeth Walton
6          1         1                  Andrews, Miss. Kornelia Theodosia
8          1         1      Appleton, Mrs. Edward Dale (Charlotte Lamson)
11         1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12         1         1                      Aubart, Mme. Leontine Pauline
...      ...       ...                                                ...
1260       3         1                            Turja, Miss. Anna Sofia
1261       3         1                             Turkula, Mrs. (Hedwig)
1286       3         1    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                   Wilkes, Mrs. James (Ellen Needs)
1300       3         1            Yasbeck, Mrs. Antoni (Selini Alexander)

         sex   age  sibsp  parch    ticket      fare    cabin embarked boat  \
0     female  29.0      0      0     24160  211.3375       B5        S    2
6     female  63.0      1      0     13502   77.9583       D7        S   10
8     female  53.0      2      0     11769   51.4792     C101        S    D
11    female  18.0      1      0  PC 17757  227.5250  C62 C64        C    4
12    female  24.0      0      0  PC 17477   69.3000      B35        C    9
...      ...   ...    ...    ...       ...       ...      ...      ...  ...
1260  female  18.0      0      0      4138    9.8417      NaN        S   15
1261  female  63.0      0      0      4134    9.5875      NaN        S   15
1286  female  38.0      0      0      2688    7.2292      NaN        C    C
1290  female  47.0      1      0    363272    7.0000      NaN        S  NaN
1300  female  15.0      1      0      2659   14.4542      NaN        C  NaN

      body            home.dest
0      NaN         St Louis, MO
6      NaN           Hudson, NY
8      NaN  Bayside, Queens, NY
11     NaN         New York, NY
12     NaN        Paris, France
...    ...                  ...
1260   NaN                  NaN
1261   NaN                  NaN
1286   NaN                  NaN
1290   NaN                  NaN
1300   NaN                  NaN

[339 rows x 14 columns]

### Exercise 6.2: Upper Class Passengers

Find passengers in either first OR second class.

How many were there?

In [55]:
# Your code here
# Hint: (titanic['pclass'] == 1) | (titanic['pclass'] == 2)
upper_class = titanic[
    (titanic['pclass'] ==1) |
    (titanic['pclass'] ==2)
]
print(upper_class)

     pclass  survived                                             name  \
0         1         1                    Allen, Miss. Elisabeth Walton
1         1         1                   Allison, Master. Hudson Trevor
2         1         0                     Allison, Miss. Helen Loraine
3         1         0             Allison, Mr. Hudson Joshua Creighton
4         1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
..      ...       ...                                              ...
595       2         0                   Wheeler, Mr. Edwin "Frederick"
596       2         1                            Wilhelms, Mr. Charles
597       2         1                     Williams, Mr. Charles Eugene
598       2         1                             Wright, Miss. Marion
599       2         0           Yrois, Miss. Henriette ("Mrs Harbeck")

        sex    age  sibsp  parch         ticket      fare    cabin embarked  \
0    female  29.00      0      0          24160  211.3375       B5        S
1      male   0.92      1      2         113781  151.5500  C22 C26        S
2    female   2.00      1      2         113781  151.5500  C22 C26        S
3      male  30.00      1      2         113781  151.5500  C22 C26        S
4    female  25.00      1      2         113781  151.5500  C22 C26        S
..      ...    ...    ...    ...            ...       ...      ...      ...
595    male    NaN      0      0  SC/PARIS 2159   12.8750      NaN        S
596    male  31.00      0      0         244270   13.0000      NaN        S
597    male    NaN      0      0         244373   13.0000      NaN        S
598  female  26.00      0      0         220844   13.5000      NaN        S
599  female  24.00      0      0         248747   13.0000      NaN        S

    boat   body                            home.dest
0      2    NaN                         St Louis, MO
1     11    NaN      Montreal, PQ / Chesterville, ON
2    NaN    NaN      Montreal, PQ / Chesterville, ON
3    NaN  135.0      Montreal, PQ / Chesterville, ON
4    NaN    NaN      Montreal, PQ / Chesterville, ON
..   ...    ...                                  ...
595  NaN    NaN                                  NaN
596    9    NaN                      London, England
597   14    NaN                      Harrow, England
598    9    NaN  Yoevil, England / Cottage Grove, OR
599  NaN    NaN                                Paris

[600 rows x 14 columns]

### Exercise 6.3: Male First Class Survivors

Find male passengers in first class who survived.

Display name, age, and fare for all of them.

In [56]:
# Your code here (three conditions with &)
results = titanic[
    (titanic['pclass'] ==1) &
    (titanic['sex'] =="male") &
    (titanic['survived'] ==1)
][['name', 'age', 'pclass']]
print(results)

                                     name    age  pclass
1          Allison, Master. Hudson Trevor   0.92       1
5                     Anderson, Mr. Harry  48.00       1
14   Barkworth, Mr. Algernon Henry Wilson  80.00       1
20          Beckwith, Mr. Richard Leonard  37.00       1
22                  Behr, Mr. Karl Howell  26.00       1
..                                    ...    ...     ...
292              Taylor, Mr. Elmer Zebley  48.00       1
295           Thayer, Mr. John Borland Jr  17.00       1
298       Tucker, Mr. Gilbert Milligan Jr  31.00       1
317       Williams, Mr. Richard Norris II  21.00       1
320                     Woolner, Mr. Hugh    NaN       1

[61 rows x 3 columns]

### Exercise 6.4: Children Who Survived

Find passengers who were 12 or younger AND survived.

How many children survived?

In [58]:
# Your code here
results = titanic[
    (titanic['age'] <=12) &
    (titanic['survived'] ==1)
]['age']
print(results)

1        0.92
54      11.00
94       4.00
273      6.00
339      1.00
340      4.00
341     12.00
359      0.83
377      8.00
385      8.00
398      8.00
427      0.67
430      6.00
434      7.00
478      1.00
479      3.00
492      1.00
514      2.00
515      3.00
540      2.00
541      8.00
548      0.83
549      3.00
582     12.00
587      2.00
588      4.00
590      0.92
591      5.00
611      0.83
641      3.00
643      5.00
657      0.75
658      0.75
659      5.00
733      9.00
734      3.00
762      1.00
763      0.17
794      5.00
820      9.00
866      2.00
894      4.00
895      1.00
916      4.00
934      4.00
1025     6.00
1048     1.00
1056    12.00
1082     9.00
1187     1.00
1189     4.00
1240     0.42
1256     7.00
1257     9.00
Name: age, dtype: float64

### Exercise 6.5: Expensive Tickets in Third Class

Find third class passengers who paid more than $20 for their fare.

How many were there? (This seems unusual - third class was cheap!)

In [59]:
# Your code here
results = titanic[
    (titanic['pclass'] ==3) &
    (titanic['fare'] >=20)
][['fare', 'pclass']]
print(results)

        fare  pclass
601   20.250       3
602   20.250       3
603   20.250       3
620   22.525       3
622   31.275       3
...      ...     ...
1210  27.900       3
1211  27.900       3
1265  24.150       3
1266  24.150       3
1267  24.150       3

[116 rows x 2 columns]

### Exercise 6.6: Complex Filter

Find passengers who meet ALL these conditions:
- Female
- Age between 20 and 40 (inclusive)
- Paid more than $30 fare

Display name, age, fare for the first 10.

In [60]:
# Your code here (four conditions!)
results = titanic[
    (titanic['age'] >=20) &
    (titanic['age'] <=40) &
    (titanic['sex'] =="female") &
    (titanic['fare'] ==30) 
][['name', 'age', 'fare']].head(10)
print(results)

                            name   age  fare
370  Christy, Miss. Julie Rachel  25.0  30.0

---

## Part 7: Advanced Sorting (Track B)

### Example: Sort by Multiple Columns

In [ ]:
# Sort by class (ascending), then by fare within each class (descending)
sorted_df = titanic.sort_values(
    ['pclass', 'fare'],           # List of columns to sort by
    ascending=[True, False]        # True for ascending, False for descending
)

# Display name, class, and fare for first 20
print(sorted_df[['name', 'pclass', 'fare']].head(20))

# This groups by class first, then sorts by fare within each class

### Exercise 7.1: Sort by Multiple Columns

Sort passengers by class (ascending), then by fare within each class (descending).

Display name, pclass, fare for the first 20 rows.

In [61]:
# Your code here
# Hint: sort_values(['pclass', 'fare'], ascending=[True, False])
Sorted = titanic.sort_values(
    ['pclass', 'fare'],
    ascending=[True, False]
)
print(Sorted[['name', 'pclass', 'fare']].head(20))

                                                  name  pclass      fare
49                  Cardeza, Mr. Thomas Drake Martinez       1  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  512.3292
183                             Lesurer, Mr. Gustave J       1  512.3292
302                                   Ward, Miss. Anna       1  512.3292
111                     Fortune, Miss. Alice Elizabeth       1  263.0000
112                         Fortune, Miss. Ethel Flora       1  263.0000
113                         Fortune, Miss. Mabel Helen       1  263.0000
114                     Fortune, Mr. Charles Alexander       1  263.0000
115                                  Fortune, Mr. Mark       1  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)       1  263.0000
35                            Bowen, Miss. Grace Scott       1  262.3750
66                         Chaudanson, Miss. Victorine       1  262.3750
249                        Ryerson, Master. John Borie       1  262.3750
250                         Ryerson, Miss. Emily Borie       1  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"       1  262.3750
252                         Ryerson, Mr. Arthur Larned       1  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)       1  262.3750
16                            Baxter, Mr. Quigg Edmond       1  247.5208
17     Baxter, Mrs. James (Helene DeLaudeniere Chaput)       1  247.5208
97   Douglas, Mrs. Frederick Charles (Mary Helene B...       1  247.5208

### Exercise 7.2: Who Paid the Least?

Find the 10 passengers who paid the lowest fares.

Display name, pclass, and fare.

In [68]:
# Your code here
lowest = titanic.sort_values('fare', ascending=True)
print(lowest[['name', 'pclass', 'fare']].head(10))

                                       name  pclass  fare
1254           Tornquist, Mr. William Henry       3   0.0
528             Parkes, Mr. Francis "Frank"       2   0.0
581              Watson, Mr. Ennis Hastings       2   0.0
473                    Knight, Mr. Robert J       2   0.0
410        Frost, Mr. Anthony Wood "Archie"       2   0.0
363                   Campbell, Mr. William       2   0.0
70    Chisholm, Mr. Roderick Robert Crispin       1   0.0
384          Cunningham, Mr. Alfred Fleming       2   0.0
896                     Johnson, Mr. Alfred       3   0.0
898         Johnson, Mr. William Cahoone Jr       3   0.0

### Exercise 7.3: Oldest in Each Class

Sort by class (ascending) and age (descending).

This groups each class together with oldest first. Display name, pclass, age for first 30.

In [69]:
# Your code here
sort_result = titanic.sort_values(
    ['pclass', 'age'],
    ascending=[True, False]
)
print(sort_result[['name', 'pclass', 'age']].head(30))

                                                  name  pclass   age
14                Barkworth, Mr. Algernon Henry Wilson       1  80.0
61   Cavendish, Mrs. Tyrell William (Julia Florence...       1  76.0
9                              Artagaveytia, Mr. Ramon       1  71.0
135                          Goldschmidt, Mr. George B       1  71.0
81                        Crosby, Capt. Edward Gifford       1  70.0
285                                 Straus, Mr. Isidor       1  67.0
205                          Millet, Mr. Francis Davis       1  65.0
221                     Ostby, Mr. Engelhart Cornelius       1  65.0
78   Compton, Mrs. Alexander Taylor (Mary Eliza Ing...       1  64.0
83   Crosby, Mrs. Edward Gifford (Catherine Elizabe...       1  64.0
115                                  Fortune, Mr. Mark       1  64.0
217                       Nicholson, Mr. Arthur Ernest       1  64.0
303                           Warren, Mr. Frank Manley       1  64.0
6                    Andrews, Miss. Kornelia Theodosia       1  63.0
286             Straus, Mrs. Isidor (Rosalie Ida Blun)       1  63.0
279                          Stead, Mr. William Thomas       1  62.0
284          Stone, Mrs. George Nelson (Martha Evelyn)       1  62.0
321                                 Wright, Mr. George       1  62.0
252                         Ryerson, Mr. Arthur Larned       1  61.0
287                              Sutton, Mr. Frederick       1  61.0
300                          Van der hoef, Mr. Wyckoff       1  61.0
43     Bucknell, Mrs. William Robert (Emma Eliza Ward)       1  60.0
116                Fortune, Mrs. Mark (Mary McDougald)       1  60.0
123                   Frolicher-Stehli, Mr. Maxmillian       1  60.0
304   Warren, Mrs. Frank Manley (Anna Sophia Atkinson)       1  60.0
305                                    Weir, Col. John       1  60.0
42      Brown, Mrs. John Murray (Caroline Lane Lamson)       1  59.0
33                            Bonnell, Miss. Elizabeth       1  58.0
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  58.0
139      Graham, Mrs. William Thompson (Edith Junkins)       1  58.0

---

## Part 8: Chaining Operations (Track B)

Combine filtering, selecting, and sorting in one statement.

### Example: Chaining Multiple Operations

In [ ]:
# Chain: Filter → Select columns → Sort → Display
result = titanic[
    titanic['survived'] == 1                    # Step 1: Filter for survivors
][['name', 'age', 'pclass']                     # Step 2: Select specific columns
].sort_values('age'                             # Step 3: Sort by age
).head(10)                                       # Step 4: Get first 10

print(result)

# This gets the 10 youngest survivors with their name, age, and class

### Exercise 8.1: Female Survivors by Age

Chain operations to:
1. Filter for female survivors
2. Select name, age, pclass columns
3. Sort by age
4. Display first 10

In [78]:
# Your code here (one long chain!)
result = titanic[
    (titanic['survived'] == 1) &
    (titanic['sex'] =="female")
][['name', 'age', 'pclass']].sort_values('age').head(10)
print(result)

                                         name   age  pclass
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17       3
657                    Baclini, Miss. Eugenie  0.75       3
658             Baclini, Miss. Helene Barbara  0.75       3
590                     West, Miss. Barbara J  0.92       2
1048              Nakid, Miss. Maria ("Mary")  1.00       3
895              Johnson, Miss. Eleanor Ileen  1.00       3
1187          Sandstrom, Miss. Beatrice Irene  1.00       3
478                     Laroche, Miss. Louise  1.00       2
866                  Hirvonen, Miss. Hildur E  2.00       3
540                  Quick, Miss. Phyllis May  2.00       2

### Exercise 8.2: First Class by Fare

Chain operations to:
1. Filter for first class
2. Select name, age, fare
3. Sort by fare (highest first)
4. Display first 15

In [79]:
# Your code here
result = titanic[
    (titanic['pclass'] == 1)
][['name', 'age', 'fare']].sort_values('fare', ascending=False).head(15)
print(result)

                                                  name   age      fare
302                                   Ward, Miss. Anna  35.0  512.3292
49                  Cardeza, Mr. Thomas Drake Martinez  36.0  512.3292
183                             Lesurer, Mr. Gustave J  35.0  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...  58.0  512.3292
115                                  Fortune, Mr. Mark  64.0  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)  60.0  263.0000
111                     Fortune, Miss. Alice Elizabeth  24.0  263.0000
113                         Fortune, Miss. Mabel Helen  23.0  263.0000
112                         Fortune, Miss. Ethel Flora  28.0  263.0000
114                     Fortune, Mr. Charles Alexander  19.0  263.0000
250                         Ryerson, Miss. Emily Borie  18.0  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  48.0  262.3750
35                            Bowen, Miss. Grace Scott  45.0  262.3750
66                         Chaudanson, Miss. Victorine  36.0  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"  21.0  262.3750

### Exercise 8.3: Young Male Survivors

Chain operations to:
1. Filter for males under 18 who survived
2. Select name, age, pclass
3. Sort by age (youngest first)
4. Display all

In [82]:
# Your code here
result = titanic[
    (titanic['survived'] == 1) &
    (titanic['sex'] =="male") &
    (titanic['age'] < 18)
][['name', 'age', 'pclass']].sort_values('age')
print(result)

                                                 name    age  pclass
1240                  Thomas, Master. Assad Alexander   0.42       3
427                         Hamalainen, Master. Viljo   0.67       2
548                   Richards, Master. George Sibley   0.83       2
359                     Caldwell, Master. Alden Gates   0.83       2
611                         Aks, Master. Philip Frank   0.83       3
1                      Allison, Master. Hudson Trevor   0.92       1
339                         Becker, Master. Richard F   1.00       2
492                             Mallet, Master. Andre   1.00       2
762                        Dean, Master. Bertram Vere   1.00       3
587                       Wells, Master. Ralph Lester   2.00       2
514                    Navratil, Master. Edmond Roger   2.00       2
734            Coutts, Master. William Loch "William"   3.00       3
549                    Richards, Master. William Rowe   3.00       2
515                        Navratil, Master. Michel M   3.00       2
641                 Asplund, Master. Edvin Rojj Felix   3.00       3
94                          Dodge, Master. Washington   4.00       1
894                   Johnson, Master. Harold Theodor   4.00       3
273                   Spedden, Master. Robert Douglas   6.00       1
1025                              Moor, Master. Meier   6.00       3
1256                   Touma, Master. Georges Youssef   7.00       3
385                    Davies, Master. John Morgan Jr   8.00       2
398                     Drew, Master. Marshall Brines   8.00       2
820   Goldsmith, Master. Frank John William "Frankie"   9.00       3
733             Coutts, Master. Eden Leslie "Neville"   9.00       3
1082                        Olsen, Master. Artur Karl   9.00       3
54                Carter, Master. William Thornton II  11.00       1
1056                     Nicola-Yarred, Master. Elias  12.00       3
249                       Ryerson, Master. John Borie  13.00       1
1236                       Svensson, Mr. Johan Cervin  14.00       3
1232                   Sunderland, Mr. Victor Francis  16.00       3
295                       Thayer, Mr. John Borland Jr  17.00       1

---

## Part 9: Extended Statistics (Track B)

### Example: Statistics by Subgroups

In [84]:
# Calculate statistics for different subgroups

# Average fare for first class
first_class = titanic[titanic['pclass'] == 1]
avg_first_fare = first_class['fare'].mean()
print(f"First class average fare: ${avg_first_fare:.2f}")

#Second class
second_class = titanic[titanic['pclass'] == 2]
avg_second_fare = second_class['fare'].mean()
print(f"Second class average fare: ${avg_second_fare:.2f}")

# Average fare for third class
third_class = titanic[titanic['pclass'] == 3]
avg_third_fare = third_class['fare'].mean()
print(f"Third class average fare: ${avg_third_fare:.2f}")

# Compare the two
print(f"Difference: ${avg_first_fare - avg_third_fare:.2f}")

First class average fare: $87.51
Second class average fare: $21.18
Third class average fare: $13.30
Difference: $74.21

### Exercise 9.1: Statistics by Class

Calculate the average fare for each class separately.

Which class paid the most on average?

In [88]:
# Your code here
first_class = titanic[titanic['pclass'] == 1]
avg_first_fare = first_class['fare'].mean()
print(f"First class: ${avg_first_fare:.2f}")

second_class = titanic[titanic['pclass'] == 2]
avg_second_fare = second_class['fare'].mean()
print(f"Second class: ${avg_second_fare:.2f}")

third_class = titanic[titanic['pclass'] == 3]
avg_third_fare = third_class['fare'].mean()
print(f"Third class: ${avg_third_fare:.2f}")

print("First class paid the most on average")

First class: $87.51
Second class: $21.18
Third class: $13.30
First class paid the most on average

### Exercise 9.2: Survival Rates by Gender

Calculate the percentage of males who survived and the percentage of females who survived.

Which gender had a higher survival rate?

In [104]:
# Your code here
Females

### Exercise 9.3: Age Statistics by Survival

Calculate:
1. Average age of survivors
2. Average age of non-survivors
3. Who was older on average?

In [105]:
# Your code here
Survivors: roughly 21
NOn: roughly 30
Older on average was the non-survivers

---

## Part 10: Analysis Questions

### Question 1: Survival Rate

What percentage of passengers survived?

In [ ]:
# Your code here
38.2%

**Answer:**

### Question 2: Class Distribution

Which class had the most passengers?

In [ ]:
# Your code here
First

**Answer:**

### Question 3: Age Comparison

What was the average age of first class vs third class passengers?

In [ ]:
# Your code here
First class was older

**Answer:**

### Question 4: Gender Distribution

Were there more male or female passengers?

In [ ]:
# Your code here
Male

**Answer:**

### Question 5: Fare Comparison

Did survivors pay more on average than non-survivors?

In [ ]:
# Your code here
Yes

**Answer:**

### Question 6: Child Survival Rate

What percentage of children (age <= 12) survived compared to adults (age > 12)?

In [ ]:
# Your code here
over 50% of children were saved, compared to the elss than 40% of adults

**Answer:**

### Question 7: Fare and Survival

Did survivors pay higher fares on average than non-survivors? Why might this be?

In [ ]:
# Your code here
Yes, the ones tha paid more were likely saved first

**Answer:**

### Question 8: Class Survival Rates

Calculate the survival rate for each class (1st, 2nd, 3rd). Which class had the highest survival rate?

In [ ]:
# Your code here
1st had the highest

**Answer:**

---

## Part 11: Critical Thinking (Track B)

### Question 9: Important Factors

Based on your analysis, what were the THREE most important factors for survival?

Support with specific statistics.

**Your Answer:**

1. Gender, females were rushed onto boats before males 
2. Age, the younger people were rushed with the women
3. Class, the rich/higher class were the first out of the men to be rushed off

### Question 10: Pandas to SQL

You filtered with: `titanic[(titanic['sex'] == 'female') & (titanic['survived'] == 1)]`

How do you think this might look in SQL? (Guess - we'll learn this next!)

**Your Answer:** Only show females that survived

---

## Submission Checklist

- [ ] Completed all exercises including Track B sections
- [ ] Run all cells successfully
- [ ] Added name and date at top
- [ ] Answered all questions
- [ ] Saved as `dbAppsTask02TrackB.ipynb`
- [ ] Pushed to GitHub

**Excellent work! You're ready for SQL!**